In [67]:
import numpy as np
import pandas as pd

In [68]:
df = pd.read_csv("https://pycourse.s3.amazonaws.com/bike-sharing.csv")

In [69]:
df.head()

     datetime  rec_id  season  year  ...  windspeed  casual  registered  total_count
0  2011-01-01       1       1     0  ...        0.0       3          13           16
1  2011-01-01       2       1     0  ...        0.0       8          32           40
2  2011-01-01       3       1     0  ...        0.0       5          27           32
3  2011-01-01       4       1     0  ...        0.0       3          10           13
4  2011-01-01       5       1     0  ...        0.0       0           1            1

[5 rows x 17 columns]

**Atribuindo apenas as colunas de interesse e colhendo informações**

In [73]:
df = df[['datetime','season', 'hour','weekday','total_count']]
df.describe()

             season          hour       weekday   total_count
count  17379.000000  17379.000000  17379.000000  17379.000000
mean       2.501640     11.546752      3.003683    189.463088
std        1.106918      6.914405      2.005771    181.387599
min        1.000000      0.000000      0.000000      1.000000
25%        2.000000      6.000000      1.000000     40.000000
50%        3.000000     12.000000      3.000000    142.000000
75%        3.000000     18.000000      5.000000    281.000000
max        4.000000     23.000000      6.000000    977.000000

**Inserindo uma coluna apenas com a informação do ano para melhor visualização**

In [74]:
df['ano'] = df['datetime'].apply(lambda x: str(x)[:4])
df.groupby('ano').count()

      datetime  season  hour  weekday  total_count
ano
2011      8645    8645  8645     8645         8645
2012      8734    8734  8734     8734         8734

In [75]:
df.query('ano == "2011"').count()

#df.query('ano == "2012"').count()

datetime       8645
season         8645
hour           8645
weekday        8645
total_count    8645
ano            8645
dtype: int64

**Colhendo informações sobre a coluna season**

In [76]:
df.groupby('season').count()
#df.groupby('season').describe()

        datetime  hour  weekday  total_count   ano
season
1           4242  4242     4242         4242  4242
2           4409  4409     4409         4409  4409
3           4496  4496     4496         4496  4496
4           4232  4232     4232         4232  4232

**Colhendo informações necessárias para responder as perguntas do enunciado**

In [78]:
df.groupby(by= 'hour')['total_count'].mean().sort_values(ascending = True).iloc[[-1]]
#df.groupby(by= 'hour')['total_count'].mean().sort_values(ascending = True).iloc[[0]]

hour
17    461.452055
Name: total_count, dtype: float64

In [79]:
df.groupby(by= 'weekday')['total_count'].mean().sort_values(ascending = True).iloc[[-1]]
#df.groupby(by= 'weekday')['total_count'].mean().sort_values(ascending = True).iloc[[0]]

weekday
4    196.436665
Name: total_count, dtype: float64

In [80]:
df = df[df['weekday'] == 3]
df.query('weekday == "3"').groupby(by='hour')['total_count'].mean().sort_values(ascending = False)

#df = df[df['weekday'] == 6]
#df.query('weekday == "6"').groupby(by='hour')['total_count'].mean().sort_values(ascending = False)

hour
17    513.144231
18    494.029126
8     488.326923
19    357.504854
7     303.980769
16    272.961538
20    256.660194
9     238.528846
21    194.669903
12    193.903846
13    185.826923
15    181.288462
14    170.548077
11    152.201923
22    143.689320
10    131.894231
6     107.807692
23     83.737864
0      34.557692
5      25.750000
1      15.336538
2       7.813725
4       4.968750
3       4.888889
Name: total_count, dtype: float64